---
kind: method
id: M:Autodesk.Revit.DB.Electrical.DistributionSysTypeSet.ReverseIterator
source: html/6571a6ee-a994-96c8-9e37-94864d1061ee.htm
---
# Autodesk.Revit.DB.Electrical.DistributionSysTypeSet.ReverseIterator Method

Retrieve a backward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual DistributionSysTypeSetIterator ReverseIterator()
```

## Returns
Returns a backward moving iterator to the set.